"""
<문제 링크>
예시 https://www.acmicpc.net/problem/25191
    
<풀이 링크>
예시 -

#----------------------------------------#
#             S U D O _ C O D E          #
#----------------------------------------#

예시: 구현하고 싶은 로직을 일단 한글로 적어보기.


"""
#-----------------------------------------------------
print(" ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■")
print(" -=-= P R O G R A M _ S T A R T =-=-")
print("▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽")
######################################################
import math # math 모듈 import

N = int(input()) # 치킨집에 있는 치킨의 총 갯수
A, B = map(int, input().split()) # A-콜라의 개수 B-맥주의 개수

chick_demand = math.floor(A/2) + B # 콜라의 개수가 3병일 때 -> 내림함수 적용

if chick_demand >= N: #치킨집에 있는 치킨 수 보다 요구량이 같거나 더 크다면
    print(N) # 치킨집에 있는 치킨 수 출력
else:
    print(chick_demand) # 요구량 출력
######################################################
print(" △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲")
print(" -=-=   P R O G R A M _ E N D   =-=-")
print(" ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■")
""" Comment
예시: 로직은 맞는데, 시간초과가 발생함. 
각 함수들마다의 디테일한 실행과정을 공부할 필요가 있을 듯 함.
"""