"""
<문제 링크>
https://www.acmicpc.net/problem/14501
    
<풀이 링크>
예시 https://wikidocs.net/206249

#----------------------------------------#
#             S U D O _ C O D E          #
#----------------------------------------#

예시: 구현하고 싶은 로직을 일단 한글로 적어보기.


"""
#-----------------------------------------------------
print(" ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■")
print(" -=-= P R O G R A M _ S T A R T =-=-")
print("▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽")
######################################################

N = int(input())
tableList = [[],[]]
for n in range(N):
    T, P = map(int, input().split())
    tableList[0].append(T)
    tableList[1].append(P)

def maximize_my_income(T,P):
    


######################################################
print(" △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲")
print(" -=-=   P R O G R A M _ E N D   =-=-")
print(" ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■")
""" Comment
예시: 로직은 맞는데, 시간초과가 발생함. 
각 함수들마다의 디테일한 실행과정을 공부할 필요가 있을 듯 함.
"""