"""
<문제 링크>
예시 https://www.acmicpc.net/problem/1436
    
<풀이 링크>
예시 https://wikidocs.net/206249

#----------------------------------------#
#             S U D O _ C O D E          #
#----------------------------------------#

예시: 구현하고 싶은 로직을 일단 한글로 적어보기.


"""
#-----------------------------------------------------
print(" ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■")
print(" -=-= P R O G R A M _ S T A R T =-=-")
print("▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽")
######################################################
fruitesList = []
N, L = map(int,input().split()) #N은 과일 수, L은 길이임.
fruitesList = list(map(int, input().split())) #후르츠 리스트 입력

sortedFruitesList = sorted(fruitesList) # 오름차순 정렬

for i in range(N): # 과일 수 만큼 반복
    if sortedFruitesList[i] <= L: #후르츠 리스트 정렬된거 스네이크 버드 길이보다 작거나 같으면 먹을 수 있음
        L = L + 1 # 먹으면 길이 증가.
    else:
        pass
print(L) # 스네이크버드 길이 출력.

######################################################
print(" △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲")
print(" -=-=   P R O G R A M _ E N D   =-=-")
print(" ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■")
""" Comment
예시: 로직은 맞는데, 시간초과가 발생함. 
각 함수들마다의 디테일한 실행과정을 공부할 필요가 있을 듯 함.
"""